<a href="https://colab.research.google.com/github/LilySu/DS-Unit-1-Sprint-2-Data-Wrangling/blob/master/Lily_Su_Assignment7_LS_DS3_123_Reshape_data_LIVE_LESSON.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

_Lambda School Data Science_

# Reshape data

Objectives
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- pandas documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

## Why reshape data?

#### Some libraries prefer data in different formats

For example, the Seaborn data visualization library prefers data in "Tidy" format often (but not always).

> "[Seaborn will be most powerful when your datasets have a particular organization.](https://seaborn.pydata.org/introduction.html#organizing-datasets) This format ia alternately called “long-form” or “tidy” data and is described in detail by Hadley Wickham. The rules can be simply stated:

> - Each variable is a column
- Each observation is a row

> A helpful mindset for determining whether your data are tidy is to think backwards from the plot you want to draw. From this perspective, a “variable” is something that will be assigned a role in the plot."

#### Data science is often about putting square pegs in round holes

Here's an inspiring [video clip from _Apollo 13_](https://www.youtube.com/watch?v=ry55--J4_VQ): “Invent a way to put a square peg in a round hole.” It's a good metaphor for data wrangling!

## Upgrade Seaborn

Run the cell below which upgrades Seaborn and automatically restarts your Google Colab Runtime.

In [0]:
!pip install seaborn --upgrade
import os
os.kill(os.getpid(), 9)#kill system restart, upgrade package that is already installed
#seaborn needs to be upgraded on collab for 0.7

Requirement already up-to-date: seaborn in /usr/local/lib/python3.6/dist-packages (0.9.0)
Requirement already satisfied, skipping upgrade: scipy>=0.14.0 in /usr/local/lib/python3.6/dist-packages (from seaborn) (1.1.0)
Requirement already satisfied, skipping upgrade: numpy>=1.9.3 in /usr/local/lib/python3.6/dist-packages (from seaborn) (1.14.6)
Requirement already satisfied, skipping upgrade: pandas>=0.15.2 in /usr/local/lib/python3.6/dist-packages (from seaborn) (0.22.0)
Requirement already satisfied, skipping upgrade: matplotlib>=1.4.3 in /usr/local/lib/python3.6/dist-packages (from seaborn) (3.0.3)
Requirement already satisfied, skipping upgrade: python-dateutil>=2 in /usr/local/lib/python3.6/dist-packages (from pandas>=0.15.2->seaborn) (2.5.3)
Requirement already satisfied, skipping upgrade: pytz>=2011k in /usr/local/lib/python3.6/dist-packages (from pandas>=0.15.2->seaborn) (2018.9)
Requirement already satisfied, skipping upgrade: kiwisolver>=1.0.1 in /usr/local/lib/python3.6/dist-packages (from matplotlib>=1.4.3->seaborn) (1.0.1)
Requirement already satisfied, skipping upgrade: pyparsing!=2.0.4,!=2.1.2,!=2.1.6,>=2.0.1 in /usr/local/lib/python3.6/dist-packages (from matplotlib>=1.4.3->seaborn) (2.3.1)
Requirement already satisfied, skipping upgrade: cycler>=0.10 in /usr/local/lib/python3.6/dist-packages (from matplotlib>=1.4.3->seaborn) (0.10.0)
Requirement already satisfied, skipping upgrade: six>=1.5 in /usr/local/lib/python3.6/dist-packages (from python-dateutil>=2->pandas>=0.15.2->seaborn) (1.11.0)
Requirement already satisfied, skipping upgrade: setuptools in /usr/local/lib/python3.6/dist-packages (from kiwisolver>=1.0.1->matplotlib>=1.4.3->seaborn) (40.8.0)

## Hadley Wickham's Examples

From his paper, [Tidy Data](http://vita.had.co.nz/papers/tidy-data.html)

In [0]:
%matplotlib inline 
#renders visualizations inline 
import pandas as pd
import numpy as np
import seaborn as sns

table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

table2 = table1.T#transpose, nice to see in a different format instead of horizontal scrolling, doing vertical scrolling

In [2]:
!ls sample data#runs linux commands, similar to conda install.

ls: cannot access 'sample': No such file or directory
ls: cannot access 'data#runs': No such file or directory
ls: cannot access 'linux': No such file or directory
ls: cannot access 'commands,': No such file or directory
ls: cannot access 'similar': No such file or directory
ls: cannot access 'to': No such file or directory
ls: cannot access 'conda': No such file or directory
ls: cannot access 'install.': No such file or directory

"Table 1 provides some data about an imaginary experiment in a format commonly seen in the wild. 

The table has two columns and three rows, and both rows and columns are labelled."

In [90]:
table1 #rendered inline like an html table in the paper

              treatmenta  treatmentb
John Smith           NaN           2
Jane Doe            16.0          11
Mary Johnson         3.0           1

"There are many ways to structure the same underlying data. 

Table 2 shows the same data as Table 1, but the rows and columns have been transposed. The data is the same, but the layout is different."

In [91]:
table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [92]:
table1.describe().T

            count      mean       std  min   25%  50%    75%   max
treatmenta    2.0  9.500000  9.192388  3.0  6.25  9.5  12.75  16.0
treatmentb    3.0  4.666667  5.507571  1.0  1.50  2.0   6.50  11.0

"Table 3 reorganises Table 1 to make the values, variables and obserations more clear.

Table 3 is the tidy version of Table 1. Each row represents an observation, the result of one treatment on one person, and each column is a variable."

| name         | trt | result |
|--------------|-----|--------|
| John Smith   | a   | -      |
| Jane Doe     | a   | 16     |
| Mary Johnson | a   | 3      |
| John Smith   | b   | 2      |
| Jane Doe     | b   | 11     |
| Mary Johnson | b   | 1      |

## Table 1 --> Tidy

We can use the pandas `melt` function to reshape Table 1 into Tidy format.

In [93]:
table1
#melting or pivoting manipulates columns. names on the left is not a column but an index. How to reset index into column?

              treatmenta  treatmentb
John Smith           NaN           2
Jane Doe            16.0          11
Mary Johnson         3.0           1

In [94]:
tidy = table1.reset_index().melt(id_vars='index')
tidy = tidy.rename(columns={
      'index': 'name',
      'variable': 'trt',
      'value': 'result'
})
tidy['trt'] = tidy['trt'].str.replace('treatment', '')
tidy

           name trt  result
0    John Smith   a     NaN
1      Jane Doe   a    16.0
2  Mary Johnson   a     3.0
3    John Smith   b     2.0
4      Jane Doe   b    11.0
5  Mary Johnson   b     1.0

#Extra challenge
What if we wanted to change 'a' and 'b' to '0 and '1'

In [95]:
tidy['trt'].replace('a',0).replace('b',1)

0    0
1    0
2    0
3    1
4    1
5    1
Name: trt, dtype: int64

In [96]:
tidy['trt'].map({'a':0})# map changes both values to 1's and 0's

0    0.0
1    0.0
2    0.0
3    NaN
4    NaN
5    NaN
Name: trt, dtype: float64

In [97]:
tidy['trt'] == 'b'

0    False
1    False
2    False
3     True
4     True
5     True
Name: trt, dtype: bool

In [98]:
(tidy['trt'] == 'b').astype(int)

0    0
1    0
2    0
3    1
4    1
5    1
Name: trt, dtype: int64

In [99]:
tidy['trt'].apply(lambda x: ord(x) - ord('a'))
#repl shell, code a little at a time and see it interact
#ord turns a into an integer number

0    0
1    0
2    0
3    1
4    1
5    1
Name: trt, dtype: int64

In [100]:
table1.index.tolist()

['John Smith', 'Jane Doe', 'Mary Johnson']

In [101]:
table1.index

Index(['John Smith', 'Jane Doe', 'Mary Johnson'], dtype='object')

In [102]:
table1.reset_index()

          index  treatmenta  treatmentb
0    John Smith         NaN           2
1      Jane Doe        16.0          11
2  Mary Johnson         3.0           1

In [103]:
table1.reset_index().melt(id_vars='index')#which of the variables do I use as id, pass in 1 or more of columns, index is what i use for id bars

          index    variable  value
0    John Smith  treatmenta    NaN
1      Jane Doe  treatmenta   16.0
2  Mary Johnson  treatmenta    3.0
3    John Smith  treatmentb    2.0
4      Jane Doe  treatmentb   11.0
5  Mary Johnson  treatmentb    1.0

## Table 2 --> Tidy

In [104]:
tidy['trt'].map({'a':0,'b':1})

0    0
1    0
2    0
3    1
4    1
5    1
Name: trt, dtype: int64

In [105]:
tidy['trt'].apply(lambda x: ord(x) - ord('a'))#converting character to where character coding is

0    0
1    0
2    0
3    1
4    1
5    1
Name: trt, dtype: int64

In [106]:
tidy

           name trt  result
0    John Smith   a     NaN
1      Jane Doe   a    16.0
2  Mary Johnson   a     3.0
3    John Smith   b     2.0
4      Jane Doe   b    11.0
5  Mary Johnson   b     1.0

In [107]:
tidy.pivot_table(index='name', columns='trt', values='result')#different from calling a pivot table from existing dataframe.

trt              a     b
name
Jane Doe      16.0  11.0
John Smith     NaN   2.0
Mary Johnson   3.0   1.0

In [108]:
tidy.pivot_table(index='name', columns='trt')#values going into result
#if data is in one format, you are not helpless to do that.

             result
trt               a     b
name
Jane Doe       16.0  11.0
John Smith      NaN   2.0
Mary Johnson    3.0   1.0

In [109]:
table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [110]:
tidy

           name trt  result
0    John Smith   a     NaN
1      Jane Doe   a    16.0
2  Mary Johnson   a     3.0
3    John Smith   b     2.0
4      Jane Doe   b    11.0
5  Mary Johnson   b     1.0

#ASSIGNMENT


#  Table 2 --> Tidy

In [111]:
table2.reset_index().melt(id_vars='index')
tidy = tidy.rename(columns={
      'index': 'trt',
      'variable': 'name',
      'value': 'result'
})
tidy['trt'] = tidy['trt'].str.replace('treatment', '')
tidy

           name trt  result
0    John Smith   a     NaN
1      Jane Doe   a    16.0
2  Mary Johnson   a     3.0
3    John Smith   b     2.0
4      Jane Doe   b    11.0
5  Mary Johnson   b     1.0

#Tidy --> Table 2

In [112]:
tidy

           name trt  result
0    John Smith   a     NaN
1      Jane Doe   a    16.0
2  Mary Johnson   a     3.0
3    John Smith   b     2.0
4      Jane Doe   b    11.0
5  Mary Johnson   b     1.0

In [113]:
table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [116]:
tidy['trt'] = tidy['trt'].replace('a', 'treatment a').replace('b', 'treatment b')
tidy=table2.reset_index().melt(id_vars='trt')
# tidy=tidy.pivot_table(index='variable',columns='value')
tidy

KeyError: ignored

# pivot and melt are opposite of each other

## Tidy --> Table 1

The `pivot_table` function is the inverse of `melt`.

## Tidy --> Table 2

## Load Instacart data

Let's return to the dataset of [3 Million Instacart Orders](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2)

If necessary, uncomment and run the cells below to re-download and extract the data

In [0]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

In [0]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

Run these cells to load the data

In [0]:
%cd instacart_2017_05_01

In [0]:
products = pd.read_csv('products.csv')

order_products = pd.concat([pd.read_csv('order_products__prior.csv'), 
                            pd.read_csv('order_products__train.csv')])

orders = pd.read_csv('orders.csv')

## Goal: Reproduce part of this example

Instead of a plot with 50 products, we'll just do two — the first products from each list
- Half And Half Ultra Pasteurized
- Half Baked Frozen Yogurt

In [0]:
from IPython.display import display, Image
url = 'https://cdn-images-1.medium.com/max/1600/1*wKfV6OV-_1Ipwrl7AjjSuw.png'
example = Image(url=url, width=600)

display(example)

So, given a `product_name` we need to calculate its `order_hour_of_day` pattern.

In [0]:
sns.catplot(x='trt', y='result',col='name',
           kind='bar',data=tidy, height=2);

## Subset and Merge

In [0]:
product_names = ['Half Baked Frozen Yogurt', 'Half And Half Ultra Pasteurized']

In [0]:
products.columns.tolist()

## 4 ways to reshape and plot

In [0]:
orders.columns.tolist()

In [0]:
order_products.columns.tolist()

In [0]:
merged = (products[['product_id', 'product_name']]
          .merge(order_products[['order_id', 'product_id']])
          .merge(orders[['order_id', 'order_hour_of_day']]))

In [0]:
products.shape, order_products.shape, orders.shape, merged.shape

In [0]:
merged.head()

In [0]:
#What condition will filter 'merged' to just the two products we care about
condition = ((merged['product_name']=='Half Baked Frozen Yogurt')
             (merged['product_name']=='Half And Half Ultra Pasteurized'))

#to this:
product_names = ['Half Baked Frozen Yogurt', 'Half And Half Ultra Pasteurized']
condition = merged['product_name'].isin(product_names)
subset = merged[condition]

In [0]:
merged.shape, subset.shape

In [0]:
subset.sample(n=5)
#give me the counts for how often an object is ordered

### 1. value_counts

In [0]:
froyo = subset[subset['product_name']=='Half Baked Frozen Yogurt')]
cream = subset[subset['product_name']=='Half And Half Ultra Pasteurized')]

In [0]:
froyo['order_hour_of_day'].value_counts().sort_index()#we're sorting by time of day

In [0]:
froyo['order_hour_of_day'].value_counts(normalized=True).sort_index()#in percentages

In [0]:
froyo['order_hour_of_day'].value_counts(normalized=True).sort_index().plot()

In [0]:
froyo['order_hour_of_day'].value_counts(normalized=True).sort_index().plot()
cream['order_hour_of_day'].value_counts(normalized=True).sort_index().plot()

### 2. crosstab

In [0]:
(pd.crosstab(subset['order_hour_of_day'],
           subset['product_name'],
           normalize='columns')*100).plot();

In [0]:
pd.crosstab(subset['order_hour_of_day'],
           subset['product_name'],
           normalize='columns').plot()

### 3. pivot_table

In [0]:
#a cross tab is a certain type of pivot table, the type of aggregation is that you count 
subset.pivot_table(index='order_hour_of_day',
                   columns='product_name',
                   values='order_id',
                  aggfunc=len).plot();

### 4. melt

In [0]:
table=pd.crosstab(subset['order_hour_of_day'],
                  subset['product_name'],
                  normalize=True)

In [0]:
sns.relplot(x)

# ASSIGNMENT
- Replicate the lesson code
- Complete the code cells we skipped near the beginning of the notebook
  - Table 2 --> Tidy
  - Tidy --> Table 2

- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [0]:
flights = sns.load_dataset('flights')

# STRETCH OPTIONS

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)